In [2]:
import pandas as pd

In [3]:
# There are 2 main data types. The first is called a Series
series = pd.Series(["BMW", "Toyota", "Honda"])

In [4]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [5]:
#Series are 1-dimensional
#Here's another example

In [6]:
colors = pd.Series(["Red","White","Blue"])

In [7]:
colors

0      Red
1    White
2     Blue
dtype: object

In [8]:
#The second data type is called a DataFrame
#DataFrames are 2-dimensional

In [9]:
car_data = pd.DataFrame({"Car_Make": series, "Color": colors})

In [10]:
car_data

  Car_Make  Color
0      BMW    Red
1   Toyota  White
2    Honda   Blue

In [11]:
#Import Data
#The above method of creating DataFrames can be tedious, so rather than combining different series into a dataframe,
#we can import data as a csv and convert that to a dataframe

In [12]:
car_sales = pd.read_csv("car-sales.csv")

In [13]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [14]:
#We can also export data using pandas

In [15]:
car_sales.to_csv("exported_car_sales.csv")

In [16]:
exported_car_sales = pd.read_csv("exported_car_sales.csv")
exported_car_sales

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

In [17]:
#You can see above that we have an extra column named Unnamed. This is referring to the index number from when we 
#exported the car sales data frame. 
#We can remove this unwanted column with one simple adjustment to the export command:

In [18]:
car_sales.to_csv("exported_car_sales.csv", index = False)
exported_car_sales = pd.read_csv("exported_car_sales.csv")
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [19]:
#As you can see, the above data frame does not have the extra index column from before.

# Describing Data

In [20]:
#Attribute
car_sales.dtypes

#Function
#car_sales.to_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [21]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [22]:
car_columns = car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [23]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [25]:
car_sales.describe()
#Only works on numeric values

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [26]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [27]:
car_sales.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [28]:
#Make a series to demonstrate the ability to take the mean of a single column
car_prices = pd.Series([3000,1500,111500])
car_prices.mean()

38666.666666666664

In [29]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [30]:
car_sales["Doors"].sum()

40

In [31]:
len(car_sales)

10